# Pipe Fitting And Accessory Pressure Drop Item Coefficient Property

Source: https://www.revitapidocs.com/2026/4855a025-3e50-9faa-c34a-16ce0dfe48c5.htm

---

| Pipe Fitting And Accessory Pressure Drop Item Coefficient Property |
| --- |

The coefficient between the begin connector and end connector, unitlesss.
**Namespace:** Autodesk.Revit.DB.Plumbing
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double Coefficient { get; set; }
```

```
Public Property Coefficient As Double
	Get
	Set
```

```
public:
property double Coefficient {
	double get ();
	void set (double value);
}
```

```
member Coefficient : float with get, set
```

#### Property Value

Double See Also

#### Reference

PipeFittingAndAccessoryPressureDropItem Class Autodesk.Revit.DB.Plumbing Namespace